# ===- Core taps -===
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "vmware-tanzu/carvel"
tap "teamookla/speedtest"

# ===- Essentials -===
brew "bash"
brew "bash-completion"
brew "bat"
brew "brew-cask-completion"
brew "colordiff"
brew "entr"
brew "fd"
brew "fzf"
brew "git"
brew "tldr"
brew "tree"
brew "watch"

brew "tmux"
cask "iterm2"
cask "ngrok"
cask "rectangle"

cask "1password"
cask "1password/tap/1password-cli"
cask "alfred"            # current = v5
# cask "signal"
cask "logseq"

# ===- Nice-to-haves -===
brew "vmware-tanzu/carvel/vendir"
brew "speedtest"

# Browsers
# cask "firefox"
# cask "google-chrome"
# cask "tor-browser"
brew "defaultbrowser"    # ref: Alfred Workflow

# ===- Encryption -===
brew "sops"
brew "age"


# ===- Container Runtimes -===
# > Podman
# brew "hyperkit"          # required by podman
# brew "podman"

# > Rancher Desktop
cask "rancher"

# ===- Kubernetes Distro -===
brew "kind"
# brew "minikube"


# ===- Common Development Tooling -===
tap "pivotal/tap"
brew "pivotal/tap/git-together"
brew "gh"   # GitHub CLI

# ===- Go -===

# brew "go@1.17" # prior versions
brew "go"
brew "golangci-lint"
cask "goland"

# ===- Java -===
# (see https://stackoverflow.com/a/32811065)
# brew "java"                                # Java13
# brew "java11"                              # Java11
# cask "adoptopenjdk/openjdk/adoptopenjdk8"  # Java8
# cask "intellij"

# ===- JavaScript -===
#brew "npm"

# JSON
brew "jq"

# YAML
brew "vmware-tanzu/carvel/ytt"
brew "yq"

# ===- Kubernetes Tooling -===
# tap "derailed/k9s"
# brew "k9s"

brew "vmware-tanzu/carvel/kapp"
# brew "kwt"

# ===- Image Building -===
# brew "buildpacks/tap/pack"    # one of the builders to can configure with kbld
brew "ko"   # images from Go apps


# ===- Graphics Tools -===
# brew "imagemagick"   # swissarmy image manipulation tool
# cask "gimp"
# brew "potrace"       # rendering SVG from bitmaps
# cask "inkscape"      # GUI for potrace


# ===- Project-Specific -===
# brew "gnu-tar"
