# ===- Core taps -===
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# ===- Essentials -===
brew "bash"
brew "bash-completion"
brew "bat"
brew "brew-cask-completion"
brew "fd"
brew "fzf"
brew "git"
brew "tldr"
brew "tree"
brew "watch"

brew "tmux"
cask "iterm2"
cask "ngrok"
cask "rectangle"

cask "1password"
cask "1password/tap/1password-cli"
cask "signal"
cask "logseq"

# Browsers
cask "firefox"
cask "google-chrome"
cask "tor-browser"
brew "defaultbrowser"    # ref: Alfred Workflow


# ===- VMs/Containers -===
tap "vmware-tanzu/carvel"

brew "hyperkit"          # required by podman
brew "podman"

# Image Building
# brew "buildpacks/tap/pack"    # one of the builders to can configure with kbld

# Kubernetes
# tap "derailed/k9s"
# brew "kind"
# brew "minikube"
# brew "kapp"
# brew "derailed/k9s/k9s"


# ===- Dev Tools -===

# git-together
brew "pivotal/tap/git-together"

# Github Command-Line Tooling
brew "gh"

# Go
brew "go@1.17"
brew "golangci-lint"
cask "goland"

# Java   (see https://stackoverflow.com/a/32811065)
# brew "java"                                # Java13
# brew "java11"                              # Java11
# cask "adoptopenjdk/openjdk/adoptopenjdk8"  # Java8
# cask "intellij"

# ===- JavaScript -===
#brew "npm"

# JSON
brew "jq"

# YAML
brew "ytt"


# ===- Project-Specific -===

brew "gnu-tar"


# ===- Image Tools -===
brew "imagemagick"   # swissarmy image manipulation tool
brew "potrace"       # rendering SVG from bitmaps
cask "inkscape"      # GUI for potrace

