# ===- Core taps -===
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "vmware-tanzu/carvel"
tap "teamookla/speedtest"
tap "aquasecurity/trivy"

# ===- Essentials -===
brew "bash"
brew "bash-completion"
brew "bat"
brew "brew-cask-completion"
brew "colordiff"
brew "entr"
brew "fd"
brew "fzf"
brew "git"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "watch"
brew "dos2unix"
brew "direnv"

brew "tmux"
cask "iterm2"
cask "ngrok"
cask "rectangle"
cask "tuple"

# cask "1password"
cask "1password/tap/1password-cli"
cask "alfred"            # current = v5
# cask "signal"
cask "logseq"

# ===- Nice-to-haves -===
#brew "vmware-tanzu/carvel/vendir"
brew "speedtest"

# Browsers
# cask "firefox"
# cask "google-chrome"
# cask "tor-browser"
# brew "brave-browser"
brew "defaultbrowser"    # ref: Alfred Workflow

# ===- Encryption -===
#brew "sops"
#brew "age"


# ===- Container Runtimes -===
# > Podman
# brew "hyperkit"          # required by podman
# brew "podman"

# > Rancher Desktop
# cask "rancher"

# ===- Kubernetes Distro -===
# brew "kind"
# brew "minikube"


# ===- Common Development Tooling -===
tap "pivotal/tap"
brew "pivotal/tap/git-together"
brew "gh"                       # GitHub CLI
brew "asdf"                     # installing multiple versions of languages (e.g. Elixir)


# ===- IDEs -===
cask "visual-studio-code"


# ===- Text File Processing -===
brew "htmlq" # HTML
brew "jq"    # JSON
brew "yq"
brew "vmware-tanzu/carvel/ytt"


# ===- Go -===
# brew "go"
# brew "golangci-lint"
# cask "goland"
# brew "go@1.17" # prior versions

# ===- Java -===
# (see https://stackoverflow.com/a/32811065)
# brew "java"                                  # Lastest (OpenJDK)
# brew "java11"                              # Java11
# cask "adoptopenjdk/openjdk/adoptopenjdk8"  # Java8
# cask "intellij"

# ===- JavaScript -===
brew "npm"
brew "node"


# ===- Network Diagnostics -===
# cask "zenmap"        # nmap and friends

# ===- Kubernetes Tooling -===
# brew "k9s"

brew "vmware-tanzu/carvel/kapp"
# brew "kwt"

# ===- Image Building -===
# brew "buildpacks/tap/pack"    # one of the builders to can configure with kbld
# brew "ko"   # images from Go apps
# brew "trivy"


# ===- Graphics Tools -===
# brew "imagemagick"   # swissarmy image manipulation tool
# cask "gimp"
# brew "potrace"       # rendering SVG from bitmaps
# cask "inkscape"      # GUI for potrace


# ===- Project-Specific -===
# brew "gnu-tar"
cask "dbeaver-community"    # dep: SQL Server

# ===- Cloud Providers -===
tap "weaveworks/tap"
brew "eksctl"
brew "terraformer"

tap "hashicorp/tap"
brew "terraform"

# ===- AWS Specific Tooling -===
brew "aws2-wrap"   # https://github.com/linaro-its/aws2-wrap
